In [1]:
# importing libraries and dataset

import numpy as np 
import pandas as pd

autos = pd.read_csv("autos.csv" , encoding = "Latin-1")

autos.head()

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
0,2016-03-24 11:52:17,Golf_3_1.6,privat,Angebot,480,test,NaN,1993,manuell,0,golf,150000,0,benzin,volkswagen,NaN,2016-03-24 00:00:00,0,70435,2016-04-07 03:16:57
1,2016-03-24 10:58:45,A5_Sportback_2.7_Tdi,privat,Angebot,18300,test,coupe,2011,manuell,190,NaN,125000,5,diesel,audi,ja,2016-03-24 00:00:00,0,66954,2016-04-07 01:46:50
2,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
3,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17
4,2016-03-31 17:25:20,Skoda_Fabia_1.4_TDI_PD_Classic,privat,Angebot,3600,test,kleinwagen,2008,manuell,69,fabia,90000,7,diesel,skoda,nein,2016-03-31 00:00:00,0,60437,2016-04-06 10:17:21

In [2]:
# some information
autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371528 entries, 0 to 371527
Data columns (total 20 columns):
dateCrawled            371528 non-null object
name                   371528 non-null object
seller                 371528 non-null object
offerType              371528 non-null object
price                  371528 non-null int64
abtest                 371528 non-null object
vehicleType            333659 non-null object
yearOfRegistration     371528 non-null int64
gearbox                351319 non-null object
powerPS                371528 non-null int64
model                  351044 non-null object
kilometer              371528 non-null int64
monthOfRegistration    371528 non-null int64
fuelType               338142 non-null object
brand                  371528 non-null object
notRepairedDamage      299468 non-null object
dateCreated            371528 non-null object
nrOfPictures           371528 non-null int64
postalCode             371528 non-null int64
lastSeen               371528 non-null object
dtypes: int64(7), object(13)
memory usage: 56.7+ MB


The dataset contains 20 columns, most of which are strings.
Some columns have null values, but none have more than ~20% null values.
The column names use camelcase instead of Python's preferred snakecase, which means we can't just replace spaces with underscores.

- Let's convert the column names from camelcase to snakecase and reword some of the column names based on the data dictionary to be more descriptive.

In [3]:
autos.columns

Index(['dateCrawled', 'name', 'seller', 'offerType', 'price', 'abtest',
       'vehicleType', 'yearOfRegistration', 'gearbox', 'powerPS', 'model',
       'kilometer', 'monthOfRegistration', 'fuelType', 'brand',
       'notRepairedDamage', 'dateCreated', 'nrOfPictures', 'postalCode',
       'lastSeen'],
      dtype='object')

In [4]:
# change column names
autos.columns = ['date_crawled', 'name', 'seller', 'offer_type', 'price', 'ab_test',
       'vehicle_type', 'registration_year', 'gearbox', 'power_ps', 'model',
       'kilo_meter', 'registration_month', 'fuel_type', 'brand',
       'unrepaired_damage', 'ad_created', 'num_photos', 'postal_code',
       'last_seen']

autos.columns

Index(['date_crawled', 'name', 'seller', 'offer_type', 'price', 'ab_test',
       'vehicle_type', 'registration_year', 'gearbox', 'power_ps', 'model',
       'kilo_meter', 'registration_month', 'fuel_type', 'brand',
       'unrepaired_damage', 'ad_created', 'num_photos', 'postal_code',
       'last_seen'],
      dtype='object')

simple logic to change the column names is to create a new list of names we want
then assign it to df.columns we are simplifying the column names to make working with data easier

- we can use DataFrame.rename(columns = {"old_name" : "new_name}) to clean the column names also

Now let's do some basic data exploration to determine what other cleaning tasks need to be done. Initially we will look for: - Text columns where all or almost all values are the same. These can often be dropped as they don't have useful information for analysis. - Examples of numeric data stored as text which can be cleaned and converted.

In [5]:
# data description fpr numerical columns
autos.describe()

,price,registration_year,power_ps,kilo_meter,registration_month,num_photos,postal_code
count,3.715280e+05,371528.000000,371528.000000,371528.000000,371528.000000,371528.0,371528.00000
mean,1.729514e+04,2004.577997,115.549477,125618.688228,5.734445,0.0,50820.66764
std,3.587954e+06,92.866598,192.139578,40112.337051,3.712412,0.0,25799.08247
min,0.000000e+00,1000.000000,0.000000,5000.000000,0.000000,0.0,1067.00000
25%,1.150000e+03,1999.000000,70.000000,125000.000000,3.000000,0.0,30459.00000
50%,2.950000e+03,2003.000000,105.000000,150000.000000,6.000000,0.0,49610.00000
75%,7.200000e+03,2008.000000,150.000000,150000.000000,9.000000,0.0,71546.00000
max,2.147484e+09,9999.000000,20000.000000,150000.000000,12.000000,0.0,99998.00000

**observations**
- num_photos column : it has one value zero it will be dropped from the dataset
- kilo_meter column ranges between (5000 - 150000) 
- registeration_year has some strange values for a year 
1000 when there was no cars and 9999 the year we do not know we will be a live or not but sure not 
- registeration_month also has min value is zero this is incorrect value

In [6]:
# for non numeric
autos.describe(include = ["O"])

,date_crawled,name,seller,offer_type,ab_test,vehicle_type,gearbox,model,fuel_type,brand,unrepaired_damage,ad_created,last_seen
count,371528,371528,371528,371528,371528,333659,351319,351044,338142,371528,299468,371528,371528
unique,280500,233531,2,2,2,8,2,251,7,40,2,114,182806
top,2016-03-24 14:49:47,Ford_Fiesta,privat,Angebot,test,limousine,manuell,golf,benzin,volkswagen,nein,2016-04-03 00:00:00,2016-04-07 06:45:59
freq,7,657,371525,371516,192585,95894,274214,30070,223857,79640,263182,14450,17

**observations for no numeric columns**

- unrepaired_damage column it has 2 unique values which it seems german value (nein) which means (no)in English will need to change it

- ad_created and last_seen columns stored as string not numeric

Let's continue exploring the data, specifically looking for data that doesn't look right. We'll start by analyzing the odometer_km and price columns. Here's the steps we'll take:
Analyze the columns using minimum and maximum values and look for any values that look unrealistically high or low (outliers) that we might want to remove.

We'll use:
Series.unique().shape to see how many unique values
Series.describe() to view min/max/median/mean etc
Series.value_counts(), with some variations:
chained to .head() if there are lots of values.

Because Series.value_counts() returns a series, we can use Series.sort_index() with ascending= True or False to view the highest and lowest values with their counts (can also chain to head() here).

When removing outliers, we can do df[(df["col"] > x ) & (df["col"] < y )], but it's more readable to use df[df["col"].between(x,y)]

In [7]:
# exploring price column
autos.kilo_meter.value_counts()

150000    240797
125000     38067
100000     15920
90000      12523
80000      11053
70000       9773
60000       8669
50000       7615
5000        7069
40000       6376
30000       6041
20000       5676
10000       1949
Name: kilo_meter, dtype: int64

In [8]:
# investigate some columns like seller and offer type
print("seller values \n" , autos["seller"].unique())
print("\n offer_type values \n" , autos.offer_type.unique())

seller values
 ['privat' 'gewerblich']

 offer_type values
 ['Angebot' 'Gesuch']

In [9]:
# exploring a column
print("number of unique values in price {}".format(autos["price"].unique().shape))

number of unique values in price (5597,)

In [10]:
# to view min/max/median/mean of a series
autos["price"].describe()

count    3.715280e+05
mean     1.729514e+04
std      3.587954e+06
min      0.000000e+00
25%      1.150000e+03
50%      2.950000e+03
75%      7.200000e+03
max      2.147484e+09
Name: price, dtype: float64

In [11]:
autos["price"].value_counts().sort_values(ascending = False).head()

0       10778
500      5670
1500     5394
1000     4649
1200     4594
Name: price, dtype: int64

the min value for the price is zero and this incorrect value for price no free cars

In [12]:
autos["price"].value_counts().sort_index(ascending = False).head(10)

2147483647     1
99999999      15
99000000       1
74185296       1
32545461       1
27322222       1
14000500       1
12345678       9
11111111      10
10010011       1
Name: price, dtype: int64

remove the zero prices from our column

In [13]:
autos = autos[autos["price"] != 0]
autos.shape

(360750, 20)

In [14]:
autos["price"].value_counts(dropna = False).sort_index()

1             1189
2               12
3                8
4                1
5               26
              ...
32545461         1
74185296         1
99000000         1
99999999        15
2147483647       1
Name: price, Length: 5596, dtype: int64

but also there are some strange prices which are very low or very high so I can take range of prices to work with 
i will take the cars price between 500 to 10,000,000

In [15]:
autos = autos[autos["price"].between(500 , 10000000)]

In [16]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 335425 entries, 1 to 371527
Data columns (total 20 columns):
date_crawled          335425 non-null object
name                  335425 non-null object
seller                335425 non-null object
offer_type            335425 non-null object
price                 335425 non-null int64
ab_test               335425 non-null object
vehicle_type          307971 non-null object
registration_year     335425 non-null int64
gearbox               321716 non-null object
power_ps              335425 non-null int64
model                 319977 non-null object
kilo_meter            335425 non-null int64
registration_month    335425 non-null int64
fuel_type             311638 non-null object
brand                 335425 non-null object
unrepaired_damage     279954 non-null object
ad_created            335425 non-null object
num_photos            335425 non-null int64
postal_code           335425 non-null int64
last_seen             335425 non-null object
dtypes: int64(7), object(13)
memory usage: 53.7+ MB

In [17]:
# explore the kilometer column
# check the unique values
autos.kilo_meter.value_counts(dropna = False).sort_index()

5000        4479
10000       1772
20000       5298
30000       5788
40000       6249
50000       7431
60000       8477
70000       9483
80000      10654
90000      11994
100000     14832
125000     35672
150000    213296
Name: kilo_meter, dtype: int64

no problem with the kilometer values it ranges between (5000 , 150000) kilometers makes sense

In [18]:
autos.head()

,date_crawled,name,seller,offer_type,price,ab_test,vehicle_type,registration_year,gearbox,power_ps,model,kilo_meter,registration_month,fuel_type,brand,unrepaired_damage,ad_created,num_photos,postal_code,last_seen
1,2016-03-24 10:58:45,A5_Sportback_2.7_Tdi,privat,Angebot,18300,test,coupe,2011,manuell,190,NaN,125000,5,diesel,audi,ja,2016-03-24 00:00:00,0,66954,2016-04-07 01:46:50
2,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
3,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17
4,2016-03-31 17:25:20,Skoda_Fabia_1.4_TDI_PD_Classic,privat,Angebot,3600,test,kleinwagen,2008,manuell,69,fabia,90000,7,diesel,skoda,nein,2016-03-31 00:00:00,0,60437,2016-04-06 10:17:21
5,2016-04-04 17:36:23,BMW_316i___e36_Limousine___Bastlerfahrzeug__Ex...,privat,Angebot,650,test,limousine,1995,manuell,102,3er,150000,10,benzin,bmw,ja,2016-04-04 00:00:00,0,33775,2016-04-06 19:17:07

**Exploring Date Columns**

In [19]:
# explore 3 date columns in the dataset
autos[["date_crawled" , "ad_created" , "last_seen"]].dtypes

date_crawled    object
ad_created      object
last_seen       object
dtype: object

the datatype for the 3 columns is string datatype we need to convert it to numeric to understand it more and try to get the range of dates

In [20]:
autos[["date_crawled" , "ad_created" , "last_seen"]].head()

          date_crawled           ad_created            last_seen
1  2016-03-24 10:58:45  2016-03-24 00:00:00  2016-04-07 01:46:50
2  2016-03-14 12:52:21  2016-03-14 00:00:00  2016-04-05 12:47:46
3  2016-03-17 16:54:04  2016-03-17 00:00:00  2016-03-17 17:40:17
4  2016-03-31 17:25:20  2016-03-31 00:00:00  2016-04-06 10:17:21
5  2016-04-04 17:36:23  2016-04-04 00:00:00  2016-04-06 19:17:07

we notice that each 10 characters in each column represent the date and the rest for time we can split the string using (str)
accessor

In [21]:
autos["date_crawled"].str[:10]

1         2016-03-24
2         2016-03-14
3         2016-03-17
4         2016-03-31
5         2016-04-04
             ...
371523    2016-03-14
371524    2016-03-05
371525    2016-03-19
371526    2016-03-20
371527    2016-03-07
Name: date_crawled, Length: 335425, dtype: object

use Series.value_counts() method to know the range of dates in this column and can use normalize attribute to get the percentages

In [22]:
autos["date_crawled"].str[:10].value_counts(dropna = False , normalize= True)

2016-04-03    0.039162
2016-04-04    0.037848
2016-03-12    0.036542
2016-03-20    0.036282
2016-03-14    0.036244
2016-03-07    0.035635
2016-03-21    0.035451
2016-04-02    0.035328
2016-03-19    0.035284
2016-03-28    0.035155
2016-04-01    0.034240
2016-03-09    0.034040
2016-03-29    0.033927
2016-03-08    0.033417
2016-03-30    0.033385
2016-03-15    0.033182
2016-03-25    0.032791
2016-03-11    0.032779
2016-03-10    0.032681
2016-03-22    0.032305
2016-03-26    0.032228
2016-03-23    0.032013
2016-03-31    0.031775
2016-03-17    0.031330
2016-03-27    0.030469
2016-03-16    0.030120
2016-03-24    0.029786
2016-03-05    0.025690
2016-03-13    0.015890
2016-03-06    0.014519
2016-03-18    0.013028
2016-04-05    0.012748
2016-04-06    0.003136
2016-04-07    0.001589
Name: date_crawled, dtype: float64

it is obvious here that this data was collected only for 2 months March and April

**investigate the other columns**

In [23]:
autos["ad_created"].str[:10]

1         2016-03-24
2         2016-03-14
3         2016-03-17
4         2016-03-31
5         2016-04-04
             ...
371523    2016-03-14
371524    2016-03-05
371525    2016-03-19
371526    2016-03-20
371527    2016-03-07
Name: ad_created, Length: 335425, dtype: object

In [24]:
autos["ad_created"].str[:10].value_counts(dropna = False , normalize = True)

2016-04-03    0.039377
2016-04-04    0.037937
2016-03-20    0.036372
2016-03-12    0.036348
2016-03-21    0.035567
                ...
2015-11-17    0.000003
2015-08-10    0.000003
2016-01-06    0.000003
2015-06-11    0.000003
2015-06-18    0.000003
Name: ad_created, Length: 114, dtype: float64

In [25]:
# sort the values
autos["ad_created"].str[:10].value_counts(dropna = False , normalize = True).sort_index()

2014-03-10    0.000003
2015-03-20    0.000003
2015-06-11    0.000003
2015-06-18    0.000003
2015-08-07    0.000003
                ...
2016-04-03    0.039377
2016-04-04    0.037937
2016-04-05    0.011564
2016-04-06    0.003130
2016-04-07    0.001520
Name: ad_created, Length: 114, dtype: float64

In [26]:
autos["registration_year"].describe()

count    335425.000000
mean       2004.549649
std          70.765875
min        1000.000000
25%        2000.000000
50%        2004.000000
75%        2008.000000
max        9999.000000
Name: registration_year, dtype: float64

minimum and maximum values are incorrect for this column and must be dropped 
- put maximum registeration year should be 2016
- minumum year should be 1950

In [27]:
autos[autos.registration_year.between(1950 , 2016)].shape

(322086, 20)

In [28]:
autos = autos[autos.registration_year.between(1950 , 2016)]
autos.head()

,date_crawled,name,seller,offer_type,price,ab_test,vehicle_type,registration_year,gearbox,power_ps,model,kilo_meter,registration_month,fuel_type,brand,unrepaired_damage,ad_created,num_photos,postal_code,last_seen
1,2016-03-24 10:58:45,A5_Sportback_2.7_Tdi,privat,Angebot,18300,test,coupe,2011,manuell,190,NaN,125000,5,diesel,audi,ja,2016-03-24 00:00:00,0,66954,2016-04-07 01:46:50
2,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
3,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17
4,2016-03-31 17:25:20,Skoda_Fabia_1.4_TDI_PD_Classic,privat,Angebot,3600,test,kleinwagen,2008,manuell,69,fabia,90000,7,diesel,skoda,nein,2016-03-31 00:00:00,0,60437,2016-04-06 10:17:21
5,2016-04-04 17:36:23,BMW_316i___e36_Limousine___Bastlerfahrzeug__Ex...,privat,Angebot,650,test,limousine,1995,manuell,102,3er,150000,10,benzin,bmw,ja,2016-04-04 00:00:00,0,33775,2016-04-06 19:17:07

In [29]:
# use the normalize attribute to check the distribution of the values in a column
autos.registration_year.value_counts(dropna = False , normalize= True).sort_index(ascending = False)

2016    0.022205
2015    0.008498
2014    0.014595
2013    0.018852
2012    0.028949
          ...
1954    0.000043
1953    0.000053
1952    0.000034
1951    0.000053
1950    0.000053
Name: registration_year, Length: 67, dtype: float64

One of the analysis techniques we learned in this course is aggregation. When working with data on cars, it's natural to explore variations across different car brands. We can use aggregation to understand the brand column.

If you recall in an earlier mission, we explored how to use loops to perform aggregation. Here's what the process looks like:

- Identify the unique values we want to aggregate by
- Create an empty dictionary to store our aggregate data
- Loop over the unique values, and for each:
    - Subset the dataframe by the unique values
    - Calculate the mean of whichever column we're interested in
    - Assign the val/mean to the dict as k/v.

In [30]:
#Explore the unique values in the brand column, and decide on which brands you want to aggregate by.
autos["brand"].unique()

array(['audi', 'jeep', 'volkswagen', 'skoda', 'bmw', 'peugeot', 'ford',
       'mazda', 'nissan', 'renault', 'mercedes_benz', 'honda', 'fiat',
       'opel', 'mini', 'smart', 'hyundai', 'subaru', 'volvo',
       'mitsubishi', 'alfa_romeo', 'kia', 'seat', 'suzuki', 'lancia',
       'porsche', 'citroen', 'toyota', 'chevrolet', 'sonstige_autos',
       'dacia', 'daihatsu', 'chrysler', 'jaguar', 'daewoo', 'rover',
       'saab', 'land_rover', 'trabant', 'lada'], dtype=object)

In [31]:
# create dictionary to store your data
dct = {}

#aggregat in the brand column to get the mean price for each brand
for brand in autos["brand"].unique():
    selected_rows = autos[autos["brand"] == brand]
    mean = selected_rows["price"].mean()
    dct[brand] = mean
    
dct

{'audi': 9754.447828969174,
 'jeep': 12636.889037433155,
 'volkswagen': 6134.822681621582,
 'skoda': 6670.407219402144,
 'bmw': 9353.178029279889,
 'peugeot': 3513.4328358208954,
 'ford': 4317.222631987577,
 'mazda': 6479.575353701046,
 'nissan': 5194.052012238174,
 'renault': 2792.08852435834,
 'mercedes_benz': 8727.044287140394,
 'honda': 4249.597795018375,
 'fiat': 3294.3959766385465,
 'opel': 3436.4386807157553,
 'mini': 10144.930074257425,
 'smart': 3676.091131498471,
 'hyundai': 5772.061899038462,
 'subaru': 4977.727414330218,
 'volvo': 5581.528161888701,
 'mitsubishi': 3850.8243297318927,
 'alfa_romeo': 4625.889549281823,
 'kia': 6052.487257019438,
 'seat': 4932.982616033755,
 'suzuki': 4863.102412604629,
 'lancia': 3875.65873015873,
 'porsche': 52890.408834586466,
 'citroen': 4015.4948522829004,
 'toyota': 5422.10632509635,
 'chevrolet': 7717.536670547148,
 'sonstige_autos': 27598.905495978554,
 'dacia': 5943.300464037123,
 'daihatsu': 2183.422750424448,
 'chrysler': 4361.151636073424,
 'jaguar': 14760.096283783783,
 'daewoo': 1234.291878172589,
 'rover': 1908.6582633053222,
 'saab': 4154.765560165975,
 'land_rover': 17092.569333333333,
 'trabant': 2361.5968586387435,
 'lada': 3308.934673366834}

In [32]:
#calculate the mean price for  a brand eg: bmw
bmw_prices = autos.loc[autos["brand"] == "bmw" , "price"]
print("the mean price for bmw car is {} ".format(bmw_prices.mean()))

the mean price for bmw car is 9353.178029279889

In [33]:
# what are the most frequent brands in our data 
autos["brand"].value_counts(dropna = False , normalize = True, ascending= False).head(10) * 100

volkswagen       21.176021
bmw              11.494446
mercedes_benz    10.263408
opel              9.959452
audi              9.367063
ford              6.398291
renault           4.391063
peugeot           2.995473
fiat              2.392218
seat              1.839571
Name: brand, dtype: float64

 volkswagen is the most frequent brand among all brand with 21.1 % out of all values
 
 
German manufacturers represent four out of the top five brands, almost 50% of the overall listings. Volkswagen is by far the most popular brand, with approximately double the cars for sale of the next two brands combined.


There are lots of brands that don't have a significant percentage of listings, so we will limit our analysis to brands representing more than 5% of total listings.

In [34]:
brand_counts = autos["brand"].value_counts(normalize=True)

brand_counts[brand_counts > .05].index

Index(['volkswagen', 'bmw', 'mercedes_benz', 'opel', 'audi', 'ford'], dtype='object')

**try groupby**

In [49]:
autos.iloc[:, 4:6].groupby("ab_test").describe()

            price                                                            \
            count         mean           std    min     25%     50%     75%
ab_test
control  155063.0  6810.535324  53531.840433  500.0  1500.0  3500.0  7999.0
test     167023.0  6884.706603  53012.174472  500.0  1500.0  3500.0  7999.0


                max
ab_test
control  10000000.0
test     10000000.0